#Include "Protheus.ch"

/*
¦+-----------------------------------------------------------------------------+¦
¦¦Programa  ¦MT110CFM          ¦ Autor ¦ Lucas Nogueira     ¦ Data ¦ 25/05/2016¦¦
¦+----------+------------------------------------------------------------------¦¦
¦¦Descrição ¦PE na Aprovação da Solicitação de Compras.       		       	   ¦¦
¦¦          ¦Tem o objetivo de validar o usuário, após a execução das ações,   ¦¦
¦¦			¦dos botões de Aprov, Rejei e Bloqueio, para todos os itens SC     ¦¦                                                             
¦+----------+------------------------------------------------------------------¦¦
¦¦Uso       ¦ MATA110						                                   ¦¦
¦+-----------------------------------------------------------------------------¦¦
¦¦			ATUALIZAÇÕES SOFRIDAS DESDE A CONSTRUÇÃO INICIAL     			   ¦¦
¦+-----------------------------------------------------------------------------¦¦
¦¦ Analista 	 ¦ Data    ¦  Motivo da Alteração				       		   ¦¦
¦+---------------+---------+---------------------------------------------------¦¦
¦¦	   			 ¦	       ¦							       				   ¦¦
¦+---------------+---------+---------------------------------------------------¦¦
¦¦	 		     ¦	       ¦											       ¦¦
¦+---------------+---------+---------------------------------------------------+¦
*/

User Function MT110CFM()

Local ExpC1  := PARAMIXB[1]     
Local ExpN1  := PARAMIXB[2]       // Validações do Usuário

	//¦+-------------------------------------------------------------+¦
	//¦¦Grava a data da aprovação	        				         ¦¦
	//¦+-------------------------------------------------------------+¦
	SC1->(RecLock("SC1",.F.))
		SC1->C1_DTAPROV	:= Date()
	SC1->(MsUnlock())


Return Nil